In [1]:
import pandas as pd
import os
os.chdir('D:\\Users\Dell\Desktop\Data Science\Datasets')

In [2]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
inp = df[['Pclass','Sex','Age','Fare']]
inp

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [6]:
inp.isnull().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [7]:
inp['Age'].fillna(inp['Age'].mean(),inplace=True)

C:\Users\Dell\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [8]:
inp

     Pclass     Sex        Age     Fare
0         3    male  22.000000   7.2500
1         1  female  38.000000  71.2833
2         3  female  26.000000   7.9250
3         1  female  35.000000  53.1000
4         3    male  35.000000   8.0500
..      ...     ...        ...      ...
886       2    male  27.000000  13.0000
887       1  female  19.000000  30.0000
888       3  female  29.699118  23.4500
889       1    male  26.000000  30.0000
890       3    male  32.000000   7.7500

[891 rows x 4 columns]

In [9]:
inp.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [10]:
inp['Pclass']=inp['Pclass'].astype(object)

C:\Users\Dell\AppData\Local\Temp/ipykernel_12856/1763329212.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inp['Pclass']=inp['Pclass'].astype(object)

In [11]:
inp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    object
 1   Sex     891 non-null    object
 2   Age     891 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), object(2)
memory usage: 28.0+ KB

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
le_Pc = LabelEncoder()
le_Sex = LabelEncoder()

In [14]:
inp['Pclass_en']=le_Pc.fit_transform(inp['Pclass'])
inp['Sex_en']=le_Sex.fit_transform(inp['Sex'])
inp.head()

C:\Users\Dell\AppData\Local\Temp/ipykernel_12856/1805130191.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inp['Pclass_en']=le_Pc.fit_transform(inp['Pclass'])
C:\Users\Dell\AppData\Local\Temp/ipykernel_12856/1805130191.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inp['Sex_en']=le_Sex.fit_transform(inp['Sex'])

  Pclass     Sex   Age     Fare  Pclass_en  Sex_en
0      3    male  22.0   7.2500          2       1
1      1  female  38.0  71.2833          0       0
2      3  female  26.0   7.9250          2       0
3      1  female  35.0  53.1000          0       0
4      3    male  35.0   8.0500          2       1

In [15]:
target=df['Survived']
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [16]:
inp_n=inp.drop(['Pclass','Sex'],1)
inp_n

C:\Users\Dell\AppData\Local\Temp/ipykernel_12856/4051758980.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  inp_n=inp.drop(['Pclass','Sex'],1)

           Age     Fare  Pclass_en  Sex_en
0    22.000000   7.2500          2       1
1    38.000000  71.2833          0       0
2    26.000000   7.9250          2       0
3    35.000000  53.1000          0       0
4    35.000000   8.0500          2       1
..         ...      ...        ...     ...
886  27.000000  13.0000          1       1
887  19.000000  30.0000          0       0
888  29.699118  23.4500          2       0
889  26.000000  30.0000          0       1
890  32.000000   7.7500          2       1

[891 rows x 4 columns]

In [17]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inp_n,target,test_size=0.2)
x_train

           Age     Fare  Pclass_en  Sex_en
132  47.000000  14.5000          2       0
198  29.699118   7.7500          2       0
847  35.000000   7.8958          2       1
811  39.000000  24.1500          2       1
618   4.000000  39.0000          1       0
..         ...      ...        ...     ...
631  51.000000   7.0542          2       1
382  32.000000   7.9250          2       1
119   2.000000  31.2750          2       0
638  41.000000  39.6875          2       0
845  42.000000   7.5500          2       1

[712 rows x 4 columns]

In [18]:
x_test

           Age      Fare  Pclass_en  Sex_en
341  24.000000  263.0000          0       0
534  30.000000    8.6625          2       0
171   4.000000   29.1250          2       1
230  35.000000   83.4750          0       0
827   1.000000   37.0042          1       1
..         ...       ...        ...     ...
494  21.000000    8.0500          2       1
356  22.000000   55.0000          0       0
613  29.699118    7.7500          2       1
748  19.000000   53.1000          0       1
886  27.000000   13.0000          1       1

[179 rows x 4 columns]

In [19]:
y_test

341    1
534    0
171    0
230    1
827    1
      ..
494    0
356    1
613    0
748    0
886    0
Name: Survived, Length: 179, dtype: int64

In [20]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [21]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [22]:
model.predict([[29.699118,	7.2292,	2,	1]])

array([0], dtype=int64)

In [23]:
model.predict([[22,	7.75,	2,0]])

array([1], dtype=int64)

In [24]:
model.score(x_test,y_test)*100

75.97765363128491